#include "l5lib.h"
int main() {

    string k;
do {
    TEquation *equations[n + m];
    fill_equations(equations);
    solve_equations(equations);
    find_sum1(equations);
    int nn;
    float root;
    get_input(nn, root);
    is_root(equations, nn, root);
    cin.ignore();
    getline(cin,k);
}while(k.empty());
    return 0;
}


/*12. Спроектувати клас TEquation, який представляє рівняння і містить
 * віртуальні методи для знаходження коренів рівняння
 * та перевірки, чи є деяке значення коренем рівняння.
 * На основі цього класу створити класи-нащадки,
 * які представляють лінійні та квадратні рівняння.
 * Створити n лінійних рівнянь та m квадратних рівнянь,
 * згенерувавши дані для них випадковим чином. Знайти суму коренів для кожного
 * із видів рівнянь (за умови, що вони існують). Перевірити,
 * чи є задане значення коренем вказаного рівняння*/
